#Область  ОбработчикиСобытийФормы
//@skip-check module-structure-form-event-regions
&НаСервере
Функция НачатьПроведениеДокументовРТУ(ДатаН,ДатаК,УникальныйИдентификатор)
	//"здесь процедура общего модуля где будет выполняться вв ввиде фонового задания"
	Перем ДлительныеОперации;
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"sps_ДлительныеОперации.ГрупповоеПроведениеДокументов"
	,"РТУ",ДатаН, ДатаК);
КонецФункции
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Объект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
    Перем ДлительныеОперацииКлиент;
	Элементы.СообщениеФорма.ВыделенныйТекст = "";
	ОбновитьОтображениеДанных();
	ДлительнаяОперация = НачатьПроведениеДокументовРТУ(Объект.датаН,КонецДня(Объект.датаК),Объект.УникальныйИдентификатор);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Фоновое выполнение длительных операций";
	//ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//РежимОткрытияОкна = БлокироватьВесьИнтерфейс;
	ПараметрыОжидания.Интервал = 2;
  	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Картинка = БиблиотекаКартинок.sps_MyCat; 

	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
 Перем СтандартныеПодсистемыКлиент;
	КоличествоПерепроведенныхПТ = 0;	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	КоличествоПерепроведенныхПТ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);

	Элементы.СообщениеФорма.ВыделенныйТекст = "Перепроведено " + КоличествоПерепроведенныхПТ + " документов"; 
    ОбновитьОтображениеДанных();
КонецПроцедуры
#КонецОбласти






