&НаСервере
Функция НачатьПроведениеДокументовРТУ(датаН,датаК,УникальныйИдентификатор)
	//"здесь процедура общего модуля где будет выполняться вв ввиде фонового задания"
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,"sps_ДлительныеОперации.ГрупповоеПроведениеДокументов"
	,"РТУ",датаН, датаК);
КонецФункции

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
    Этаформа.Элементы.СообщениеФорма.ВыделенныйТекст = "";
	Этаформа.ОбновитьОтображениеДанных();
	ДлительнаяОперация = НачатьПроведениеДокументовРТУ(Объект.датаН,КонецДня(Объект.датаК),Объект.УникальныйИдентификатор);
	
	// 2. Подключение обработчика завершения фонового задания.
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Фоновое выполнение длительных операций";
	//ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	//РежимОткрытияОкна = БлокироватьВесьИнтерфейс;
	ПараметрыОжидания.Интервал = 2;
  	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Картинка = БиблиотекаКартинок.sps_MyCat; 

	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
 КоличествоПерепроведенныхПТ = 0;	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	КоличествоПерепроведенныхПТ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);

	Этаформа.Элементы.СообщениеФорма.ВыделенныйТекст = "Перепроведено " + КоличествоПерепроведенныхПТ + " документов"; 
    Этаформа.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Объект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры




