
//@skip-check module-structure-method-in-regions
//@skip-check doc-comment-export-function-return-section
Функция ГрупповоеПроведениеДокументов(ТипДок,Начало_периода,Окончание_периода) Экспорт
	Перепроведено_количество = 0;
	КоличествоДляОбработки =0;
	Если ТипДок = "ПТ" Тогда
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		ВыборкаК =  Документы.ПриобретениеТоваровУслуг.Выбрать(Начало_периода, Окончание_периода); 
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		Выборка = Документы.ПриобретениеТоваровУслуг.Выбрать(Начало_периода, Окончание_периода); 
	ИначеЕсли  ТипДок = "РТУ" Тогда
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		ВыборкаК =  Документы.РеализацияТоваровУслуг.Выбрать(Начало_периода, Окончание_периода);
		//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
		Выборка = Документы.РеализацияТоваровУслуг.Выбрать(Начало_периода, Окончание_периода); 
	КонецЕсли;
	
	Пока ВыборкаК.Следующий() Цикл
		 КоличествоДляОбработки = КоличествоДляОбработки +1;
	 КонецЦикла;	
	 Если  КоличествоДляОбработки > 0 Тогда
	 Дельта = Окр(100/КоличествоДляОбработки,1);
     Иначе
	 Дельта =0;
 КонецЕсли;
 
	 ПроцентВыполнения = 0;
	 Описание = "Идет перепроведение документов"; 
	
	 Пока Выборка.Следующий()  Цикл
		ПроцентВыполнения = ПроцентВыполнения + Дельта;
		//@skip-check empty-except-statement
		Попытка
			ДокОбъект = Выборка.ПолучитьОбъект();  	
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			Перепроведено_количество = Перепроведено_количество +1 ;
			//@skip-check undefined-variable
			ДлительныеОперации.СообщитьПрогресс(Окр(ПроцентВыполнения, 0), Описание);	
		исключение 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Что то пошло не так";
			Сообщение.Сообщить();
		КонецПопытки;		
	КонецЦикла; 	

	возврат Перепроведено_количество ;
КонецФункции 

//@skip-check module-structure-method-in-regions
//@skip-check doc-comment-export-function-return-section
//@skip-check doc-comment-parameter-section
Функция ГрупповоеМногопоточноеПроведениеДокументов(Поток,Адрес) Экспорт
	Перепроведено_количество = 0;
			
	КоличествоДокументов = Поток.ТЗПотока.Количество();
	Дельта = Окр(100/КоличествоДокументов,1);
    ПроцентВыполнения = 0;
    Описание = "Идет перепроведение документов поток " + Поток.КодПотока; 
	
	 Для каждого эл ИЗ Поток.ТЗПотока  Цикл
		ПроцентВыполнения = ПроцентВыполнения + Дельта;
		перепроведено_количество = перепроведено_количество +1;
		//@skip-check empty-except-statement
		Попытка
			ДокОбъект = эл.ссылка.ПолучитьОбъект();  	
			ДокОбъект.Комментарий = ДокОбъект.Комментарий + " ..." + Поток.КодПотока; 
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			//@skip-check undefined-variable
			ДлительныеОперации.СообщитьПрогресс(Окр(ПроцентВыполнения, 0), Описание);	
		исключение 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Что то пошло не так";
			Сообщение.Сообщить();
		КонецПопытки;		
	КонецЦикла; 	
 	возврат Перепроведено_количество ;
КонецФункции  

